In [9]:
import pandas as pd
import numpy as np

In [18]:
demog = pd.read_csv('m5_survey_data_demographics.csv')
tech = pd.read_csv('m5_survey_data_technologies_normalised.csv')
job = pd.read_excel('01_job_postings.xlsx')
pop = pd.read_csv('04_popular-languages.csv')

In [19]:
df_demog = demog.copy()
df_tech = tech.copy()
df_job = jobs.copy()
df_pop = pop.copy()

In [20]:
df_demog.head(1)

,Respondent,MainBranch,Hobbyist,OpenSourcer,OpenSource,Employment,Country,Student,EdLevel,UndergradMajor,...,WelcomeChange,SONewContent,Age,Gender,Trans,Sexuality,Ethnicity,Dependents,SurveyLength,SurveyEase
0,4,I am a developer by profession,No,Never,The quality of OSS and closed source software ...,Employed full-time,United States,No,"Bachelor’s degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,22.0,Man,No,Straight / Heterosexual,White or of European descent,No,Appropriate in length,Easy

In [21]:
df_tech.head(2)

,Respondent,LanguageWorkedWith,LanguageDesireNextYear,DatabaseWorkedWith,DatabaseDesireNextYear,PlatformWorkedWith,PlatformDesireNextYear,WebFrameWorkedWith,WebFrameDesireNextYear,DevEnviron,OpSys,Containers,BlockchainOrg,BlockchainIs
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,4.0,C,C,MySQL,MySQL,Linux,Linux,NaN,NaN,Eclipse,NaN,NaN,NaN,NaN

In [246]:
df_job.head(2)

  Technology       Location  Num_of_Jobs
0          C  San Francisco          214
1          C   Philadelphia           20

In [23]:
df_pop.head(2)

   0 Language Average Annual Salary
0  1   Python              $114,383
1  2     Java              $101,013

In [247]:
df_job.groupby('Location')['Num_of_Jobs'].sum().reset_index().sort_values(by='Num_of_Jobs').head()

         Location  Num_of_Jobs
9    Philadelphia           26
0          Austin          303
10  San Francisco          305
6     Los Angeles          400
7     New Orleons          605

In [248]:
df_job.groupby('Technology')['Num_of_Jobs'].sum().reset_index().sort_values(by='Num_of_Jobs').head()

          Technology  Num_of_Jobs
6       MySQL Server            0
8   PostgreSQLappend            0
11             Scala           33
5            MongoDB          174
10        SQL Server          250

In [36]:
df_jobs = pd.read_csv('jobs.csv')
top10_Laguages = ['JavaScript', 'Html', 'SQL', 'Bash', 'Python', 'Java', 'C#', 'Typescript', 'PHP', 'C+\+', 'C']
d = {'Language' : [] , 'Num_of_Jobs' : []}
for i in top10_Laguages:
    d['Language'] += [i]
    d['Num_of_Jobs'] += [df_jobs.loc[df_jobs['Key Skills'].str.contains(i), ['Key Skills']].count()[0]]
    print(i , df_jobs.loc[df_jobs['Key Skills'].str.contains(i), ['Key Skills']].count()[0])
pd.DataFrame(data=d).sort_values(by= 'Num_of_Jobs', ascending=False)

JavaScript 355
Html 164
SQL 2636
Bash 25
Python 1173
Java 2609
C# 333
Typescript 1
PHP 647
C+\+ 305
C 13498

      Language  Num_of_Jobs
10           C        13498
2          SQL         2636
5         Java         2609
4       Python         1173
8          PHP          647
0   JavaScript          355
6           C#          333
9         C+\+          305
1         Html          164
3         Bash           25
7   Typescript            1

In [244]:
df_new = df_jobs['Key Skills'].str.split('|', expand= True)
df_new.rename(columns = lambda x : 'a' + str(x), inplace=True)
for i in df_new.columns:
    df_new[i] = df_new[i].str.lower()
    df_new[i] = df_new[i].str.strip()
df_new.head(2)

,a0,a1,a2,a3,a4,a5,a6,a7,a8,a9,...,a26,a27,a28,a29,a30,a31,a32,a33,a34,a35
0,media planning,digital media,None,None,None,None,None,None,None,None,...,None,None,None,None,None,None,None,None,None,None
1,pre sales,closing,software knowledge,clients,requirements,negotiating,client,online bidding,good communication,technology,...,None,None,None,None,None,None,None,None,None,None

In [271]:
# For Job 'C' conatins doesn't work:
L=[]
for i in df_new.columns:
    index = df_new.loc[df_new[i] == 'c'].index
    for i in index:
        L.append(i)

len(set(L))

817

In [269]:
df_jobs.loc[12032, ['Key Skills']].to_list()

['Server| SQL| UNIX| development| c| C| test| software| level| simulation| testing| networking| automation| perl| programming| unix| hardware']

In [240]:
L2 = df_jobs.loc[df_jobs['Key Skills'].str.contains('C#')].index
print(len(L2))
L2.difference(L)

333

Int64Index([  563,   892,  2134,  2137,  3409,  4194,  4603,  6769,  9785,
            10898, 11393, 11555, 13634, 15769, 15920, 16433, 17745, 21084,
            21870, 22142, 23661, 24688, 25050, 25362, 26150],
           dtype='int64')

In [241]:
for i in L2.difference(L):
    print(df_jobs.loc[i, ['Key Skills']].to_list())

['Telerik| C#.Net| Process Streamlining| Technical Lead| Selenium| Functional']
['jQuery| C| Web technologies| Web services| C#.Net| Cloud| Javascript| ASP.Net| HTML| SQL']
['MS SQL| jQuery| VB.NET| Coding| C#.Net| Javascript| ASP.Net| .Net| Web reporting| MVC']
['Computer science| Backend| Information technology| GIT| Web technologies| SQL database| PAAS| C#.Net| SQL Azure| Cosmos']
['CSS| VB.NET| XML| C#.Net| Javascript| ASP.Net| HTML| Visual Studio| Web Designing| Ajax']
['ASP.Net MVC| SQL Server| WCF| LINQ| WPF| C#.Net| .Net| OOPS| Web Technologies| Secondary Skills']
['Corporate Strategy| Capital Markets| R| Trading| Algorithmic Trading| Research| SPSS| C# .Net| MATLAB| Analytics']
['ASP.Net MVC| C#.Net| SQL Azure| .NET Framework| Web Development| Web Technologies| Product Development| Design Development| Oracle Service Bus| CI| CD| Angularjs| React.Js']
['C#.Net| SQL Server| Net']
['Software Engineering|Business Rules|Tool Design|System Analysis|SQL Development|Database Design|Integration Testing|C#.NET|MS SQL Server|Technology Solutions|SQL Queries|.NET']
['.net azure|ms azure|asp.net azure|aspdotnet azure|microsoft azure|web api|C# Azure|azure|asp dot net azure']
['Design Patterns| Html5| OOPS| C#.Net| Javascript| ASP.Net| Team Foundation Server| .Net| Entity Framework| Page']
['C#.Net| ASP.Net| .Net']
['VB.NET| Architecture| Coding| XML| C#.Net| ASP.Net| Microsoft technologies| SQL']
['Application Development| Agile Methodology| VB.NET| C#.Net| product development| Javascript| MVC| WCF| SQL']
['Angularjs| CSS| Web Technologies| HTML| Node.Js| SQL Server| JQuery| Software Development| Mean Stack| C#.Net| Javascript| ASP.Net| Ajax']
['E-learning| SQL queries| Windows Services| ADO.Net| C#.Net| Software development life cycle| ASP.Net| WCF| Object oriented programming| SDLC']
['Minimum two years of experience working on the .NET platform using C# and ASP.NE']
['Software Development| LINQ| MVVM| OOPS| C#.Net| SQL Database| Entity Framework| SQL Server| Visual Studio| WPF']
['SQL| jQuery| WCF| MVC| Entity framework| MVVM| C#.Net| ASP.Net| Web technologies| Business Executive']
['ASP| .Net| SQL Server| C#. NET| OOPS| JavaScript| .NET Framework| architecture| Object Oriented design']
['Java| Software Development| LINQ| C| C#.Net| Javascript| ASP.Net| PHP| .Net| LAMP']
['Javascript|LINQ|JQuery|Ajax|ASP.Net|MS SQL Server|Angularjs|C#.Net|CSS|Html5|Python Developer|Python']
['LINQ| Silverlight| Developer| JQuery| WPF| Software Developer| Programmer| C#.Net| Javascript| ASP.Net| WCF| MVC| SQL Developer| Ajax']
['Team Lead| Dot Net Developer| C# developer| MVC| WCF']

In [200]:
df_job.groupby('Technology')['Num_of_Jobs'].sum().reset_index().sort_values(by='Num_of_Jobs')

          Technology  Num_of_Jobs
6       MySQL Server            0
8   PostgreSQLappend            0
11             Scala           33
5            MongoDB          174
10        SQL Server          250
2                C++          305
1                 C#          333
4         JavaScript          355
7             Oracle          784
9             Python         1173
3               Java         2609
0                  C        13498